In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('75_csv_file_for_pandas.csv')

In [5]:
df.head()

,id,firstname,lastname,email,email2,profession
0,100,Rani,Cherianne,Rani.Cherianne@yopmail.com,Rani.Cherianne@gmail.com,developer
1,101,Flo,Whiffen,Flo.Whiffen@yopmail.com,Flo.Whiffen@gmail.com,worker
2,102,Berta,Vorster,Berta.Vorster@yopmail.com,Berta.Vorster@gmail.com,developer
3,103,Evaleen,Marden,Evaleen.Marden@yopmail.com,Evaleen.Marden@gmail.com,worker
4,104,Meg,Ferino,Meg.Ferino@yopmail.com,Meg.Ferino@gmail.com,worker

In [6]:
df.tail()

,id,firstname,lastname,email,email2,profession
995,1095,Benita,Kussell,Benita.Kussell@yopmail.com,Benita.Kussell@gmail.com,worker
996,1096,Carilyn,Serilda,Carilyn.Serilda@yopmail.com,Carilyn.Serilda@gmail.com,developer
997,1097,Fanchon,Hashim,Fanchon.Hashim@yopmail.com,Fanchon.Hashim@gmail.com,firefighter
998,1098,Hyacinthe,Naashom,Hyacinthe.Naashom@yopmail.com,Hyacinthe.Naashom@gmail.com,developer
999,1099,Trixi,Westphal,Trixi.Westphal@yopmail.com,Trixi.Westphal@gmail.com,worker

In [7]:
df.columns

Index(['id', 'firstname', 'lastname', 'email', 'email2', 'profession'], dtype='object')

In [8]:
df['name'] = df['firstname'] + ' ' + df['lastname']

In [9]:
df

,id,firstname,lastname,email,email2,profession,name
0,100,Rani,Cherianne,Rani.Cherianne@yopmail.com,Rani.Cherianne@gmail.com,developer,Rani Cherianne
1,101,Flo,Whiffen,Flo.Whiffen@yopmail.com,Flo.Whiffen@gmail.com,worker,Flo Whiffen
2,102,Berta,Vorster,Berta.Vorster@yopmail.com,Berta.Vorster@gmail.com,developer,Berta Vorster
3,103,Evaleen,Marden,Evaleen.Marden@yopmail.com,Evaleen.Marden@gmail.com,worker,Evaleen Marden
4,104,Meg,Ferino,Meg.Ferino@yopmail.com,Meg.Ferino@gmail.com,worker,Meg Ferino
...,...,...,...,...,...,...,...
995,1095,Benita,Kussell,Benita.Kussell@yopmail.com,Benita.Kussell@gmail.com,worker,Benita Kussell
996,1096,Carilyn,Serilda,Carilyn.Serilda@yopmail.com,Carilyn.Serilda@gmail.com,developer,Carilyn Serilda
997,1097,Fanchon,Hashim,Fanchon.Hashim@yopmail.com,Fanchon.Hashim@gmail.com,firefighter,Fanchon Hashim
998,1098,Hyacinthe,Naashom,Hyacinthe.Naashom@yopmail.com,Hyacinthe.Naashom@gmail.com,developer,Hyacinthe Naashom
999,1099,Trixi,Westphal,Trixi.Westphal@yopmail.com,Trixi.Westphal@gmail.com,worker,Trixi Westphal

In [11]:
s = df['name']

In [12]:
s

0         Rani Cherianne
1            Flo Whiffen
2          Berta Vorster
3         Evaleen Marden
4             Meg Ferino
             ...
995       Benita Kussell
996      Carilyn Serilda
997       Fanchon Hashim
998    Hyacinthe Naashom
999       Trixi Westphal
Name: name, Length: 1000, dtype: object

In [13]:
len(s)

1000

In [20]:
s1 = df['name'][0:3]

In [21]:
s1

0    Rani Cherianne
1       Flo Whiffen
2     Berta Vorster
Name: name, dtype: object

In [17]:
type(s1)

pandas.core.series.Series

In [22]:
l = ['a', 'b', 'c']

In [26]:
pd.Series(list(s1), index=l)

a    Rani Cherianne
b       Flo Whiffen
c     Berta Vorster
dtype: object

In [50]:
""" okay so i'm creating a roll list of my friends """
import pandas as pd

data = {'Name': ['Ashutosh', 'Sanket', 'Prabhanshu', 'Hritik', 'Yogendra']}

df = pd.DataFrame(data)

In [51]:
df

         Name
0    Ashutosh
1      Sanket
2  Prabhanshu
3      Hritik
4    Yogendra

so basically the indexing is 0,1,2,... but i want the indexing as their roll number

In [29]:
l = ['20', '78', '66', '39', '99']

In [31]:
new_index = pd.Series(list(df['Name']), index=l)

In [32]:
new_index

20      Ashutosh
78        Sanket
66    Prabhanshu
39        Hritik
99      Yogendra
dtype: object

In [38]:
df.columns

Index(['Name'], dtype='object')

In [39]:
df['Name']

0      Ashutosh
1        Sanket
2    Prabhanshu
3        Hritik
4      Yogendra
Name: Name, dtype: object

the datafrom which we recieve from df['Name'] is "Series"

In [40]:
s = df['Name']

In [41]:
s

0      Ashutosh
1        Sanket
2    Prabhanshu
3        Hritik
4      Yogendra
Name: Name, dtype: object

In [42]:
df['college'] = ['IIT', 'IIT', 'IIT', 'IIT', 'IIT']

In [43]:
df

         Name college
0    Ashutosh     IIT
1      Sanket     IIT
2  Prabhanshu     IIT
3      Hritik     IIT
4    Yogendra     IIT

In [44]:
df['city'] = ['Jabalpur', 'Jabalpur', 'Jabalpur', 'Jabalpur', 'Jabalpur']

In [45]:
df

         Name college      city
0    Ashutosh     IIT  Jabalpur
1      Sanket     IIT  Jabalpur
2  Prabhanshu     IIT  Jabalpur
3      Hritik     IIT  Jabalpur
4    Yogendra     IIT  Jabalpur

In [46]:
len(df)

5

In [47]:
s1 = df['Name'][0:3]

In [48]:
s1

0      Ashutosh
1        Sanket
2    Prabhanshu
Name: Name, dtype: object

In [49]:
l = ['20', '78', '66', '39', '99']

In [52]:
df

         Name
0    Ashutosh
1      Sanket
2  Prabhanshu
3      Hritik
4    Yogendra

In [53]:
new_index = pd.Series(list(s), index=l)

In [54]:
new_index

20      Ashutosh
78        Sanket
66    Prabhanshu
39        Hritik
99      Yogendra
dtype: object

---

In [56]:
import pandas as pd

In [57]:
data = {'Faculty-Names': ['Loveleen Mam', 'Tandon Sir', 'Neelu Mam', 'Sujeet Sir', 'Pooja Mam', 'Bharti Mam'],
        'Subject': ['HOD', 'DSA and DBMS', 'Internet and web technology', 'Computer network', 'TOC', 'SE'], }

new_df = pd.DataFrame(data)

In [58]:
new_df

  Faculty-Names                      Subject
0  Loveleen Mam                          HOD
1    Tandon Sir                 DSA and DBMS
2     Neelu Mam  Internet and web technology
3    Sujeet Sir             Computer network
4     Pooja Mam                          TOC
5    Bharti Mam                           SE

In [59]:
sex = ['Female', 'Male', 'Female', 'Male', 'Female', 'Female']

In [68]:
new_index_series = pd.Series(list(new_df['Faculty-Names']), index=sex)

In [64]:
new_df

  Faculty-Names                      Subject
0  Loveleen Mam                          HOD
1    Tandon Sir                 DSA and DBMS
2     Neelu Mam  Internet and web technology
3    Sujeet Sir             Computer network
4     Pooja Mam                          TOC
5    Bharti Mam                           SE

In [69]:
new_index_series

Female    Loveleen Mam
Male        Tandon Sir
Female       Neelu Mam
Male        Sujeet Sir
Female       Pooja Mam
Female      Bharti Mam
dtype: object

In [71]:
new_df['Faculty-Names'][0]

'Loveleen Mam'

In [72]:
new_index_series[0]

'Loveleen Mam'

In [73]:
new_index_series['Female']

Female    Loveleen Mam
Female       Neelu Mam
Female       Pooja Mam
Female      Bharti Mam
dtype: object

In [74]:
new_index_series['Male']

Male    Tandon Sir
Male    Sujeet Sir
dtype: object

In [79]:
s4 = pd.Series([2,4,6,8,10], index=['a','b','c','d','e'])

In [80]:
s4

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [85]:
s5 = pd.Series([20,40,60,80,100], index=['b','a','e','c','d'])

In [86]:
s5

b     20
a     40
e     60
c     80
d    100
dtype: int64

In [87]:
s6 = s4.append(s5)

/var/folders/y4/6zfff_pj0h39ylj3s39306rc0000gn/T/ipykernel_3149/937876903.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s6 = s4.append(s5)

In [88]:
s6

a      2
b      4
c      6
d      8
e     10
b     20
a     40
e     60
c     80
d    100
dtype: int64

In [90]:
s6['a']

a     2
a    40
dtype: int64

In [91]:
s6[0:5]

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [92]:
s4

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [93]:
s5

b     20
a     40
e     60
c     80
d    100
dtype: int64

In [94]:
s4 * s5

a     80
b     80
c    480
d    800
e    600
dtype: int64

In [95]:
s4 + s5

a     42
b     24
c     86
d    108
e     70
dtype: int64

In [96]:
s4 - s5

a   -38
b   -16
c   -74
d   -92
e   -50
dtype: int64

In [97]:
s4 % s5

a     2
b     4
c     6
d     8
e    10
dtype: int64